In [86]:
#creating series in pandas
import pandas as pd
import numpy as np
series = pd.Series([10,30,50,70,90])
print("Series created with Pandas:\n\n",series)

Series created with Pandas:

 0    10
1    30
2    50
3    70
4    90
dtype: int64

In [87]:
data = {'Name':['Abhi',"abhi"], 'Age': [21,np.nan], 'College': ["BRECW", "HPS"],'Salary': [200000,12000] }
df = pd.DataFrame(data)
print(df)

   Name   Age College  Salary
0  Abhi  21.0   BRECW  200000
1  abhi   NaN     HPS   12000

In [88]:
#prints first 5 rows
print(df.head())
print("\n")

#prints last n number of rows
print(df.tail(1))
print("\n")

#printing single column
print(df['Age'])
print("\n")
print(df[['Age', 'College']])

   Name   Age College  Salary
0  Abhi  21.0   BRECW  200000
1  abhi   NaN     HPS   12000


   Name  Age College  Salary
1  abhi  NaN     HPS   12000


0    21.0
1     NaN
Name: Age, dtype: float64


    Age College
0  21.0   BRECW
1   NaN     HPS

In [89]:
#columns operations in pandas

print("Column Information:\n",df.columns)
print("\nInformation:\n",df.info)
print("\nDescribe:\n",df.describe)

Column Information:
 Index(['Name', 'Age', 'College', 'Salary'], dtype='object')

Information:
 <bound method DataFrame.info of    Name   Age College  Salary
0  Abhi  21.0   BRECW  200000
1  abhi   NaN     HPS   12000>

Describe:
 <bound method NDFrame.describe of    Name   Age College  Salary
0  Abhi  21.0   BRECW  200000
1  abhi   NaN     HPS   12000>

In [90]:
#deleting, missing values and their operations

#drop a column
print(df)
print("\n")
print(df.drop('Salary', axis=1))

#check for missing values
print("\n")

   Name   Age College  Salary
0  Abhi  21.0   BRECW  200000
1  abhi   NaN     HPS   12000


   Name   Age College
0  Abhi  21.0   BRECW
1  abhi   NaN     HPS

In [91]:
df

   Name   Age College  Salary
0  Abhi  21.0   BRECW  200000
1  abhi   NaN     HPS   12000

In [92]:
df.drop('Salary',axis = 1)

   Name   Age College
0  Abhi  21.0   BRECW
1  abhi   NaN     HPS

In [93]:
print(df.isnull())

    Name    Age  College  Salary
0  False  False    False   False
1  False   True    False   False

In [94]:
df

   Name   Age College  Salary
0  Abhi  21.0   BRECW  200000
1  abhi   NaN     HPS   12000

In [95]:
df.drop('Salary',axis = 1,inplace=True)

In [96]:
df

   Name   Age College
0  Abhi  21.0   BRECW
1  abhi   NaN     HPS

In [97]:
df.isnull()

    Name    Age  College
0  False  False    False
1  False   True    False

In [98]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [99]:
df

   Name   Age College
0  Abhi  21.0   BRECW
1  abhi  21.0     HPS

In [101]:
#adding column
df['Salary'] = [500000, 7000000]
df

   Name   Age College   Salary
0  Abhi  21.0   BRECW   500000
1  abhi  21.0     HPS  7000000

In [103]:
#sorint dataframe by column
print(df.sort_values(by = 'Name'))

   Name   Age College   Salary
0  Abhi  21.0   BRECW   500000
1  abhi  21.0     HPS  7000000

In [104]:
#grouping data
group = df.groupby('Name')['Salary'].mean()
df

   Name   Age College   Salary
0  Abhi  21.0   BRECW   500000
1  abhi  21.0     HPS  7000000

In [112]:
#creatinf two dataframes and their operartion
df1 = pd.DataFrame({'Roll.No': ['22321A0501','22321A0502', '22321A0503'], 'Name': ['Abhignya','Abhinaya','Aditi']})
df2 = pd.DataFrame({'Name':['Abhignya','Abhinaya','Aditi'],'Hobbies': ['Boxing','Drawing','Reading']})
print(df1)
print("\n")
print(df2)

      Roll.No      Name
0  22321A0501  Abhignya
1  22321A0502  Abhinaya
2  22321A0503     Aditi


       Name  Hobbies
0  Abhignya   Boxing
1  Abhinaya  Drawing
2     Aditi  Reading

In [114]:
#two dataframe operations

#concating them
df3 = pd.concat([df1,df2], axis = 0)
df3

      Roll.No      Name  Hobbies
0  22321A0501  Abhignya      NaN
1  22321A0502  Abhinaya      NaN
2  22321A0503     Aditi      NaN
0         NaN  Abhignya   Boxing
1         NaN  Abhinaya  Drawing
2         NaN     Aditi  Reading

In [121]:
#mergign them
merged = pd.merge(df1,df2, on = 'Name')
print(merged)

      Roll.No      Name  Hobbies
0  22321A0501  Abhignya   Boxing
1  22321A0502  Abhinaya  Drawing
2  22321A0503     Aditi  Reading